In [1]:
import matplotlib.pyplot as plt
import oracledb
import pandas as pd

conn = oracledb.connect(user='ora_user', password='1111', dsn = 'localhost:1521/xe')
print(conn.version)

cursor = conn.cursor()
query= 'select employee_id, salary from employees'

df = pd.read_sql_query(query,conn)
df

18.0.0.0.0

C:\Users\KOREAVC\AppData\Local\Temp\ipykernel_11272\2414906167.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query,conn)

     EMPLOYEE_ID   SALARY
0            198   2600.0
1            199   2600.0
2            200   4400.0
3            201  13000.0
4            202   6000.0
..           ...      ...
102          193   3900.0
103          194   3200.0
104          195   2800.0
105          196   3100.0
106          197   3000.0

[107 rows x 2 columns]

In [24]:
x_list = list(df['EMPLOYEE_ID'].head(10))
x_list

[198, 199, 200, 201, 202, 203, 204, 205, 206, 100]

In [25]:
y_list = list(df['SALARY'].head())
y_list

[2600.0, 2600.0, 4400.0, 13000.0, 6000.0]